#จงเขียนโปรแกรมระบบตรวจสอบสิทธิ์รับวัคซีนพิเศษ รัฐบาลเปิดโครงการวัคซีนพิเศษให้ประชาชน โดยมีเงื่อนไขดังนี้

# เงื่อนไข:
#     1. อายุ (Age)
#     2. กลุ่มเสี่ยง (Risk Group)
#         • ตั้งครรภ์
#         • ผู้สูงอายุ
#         • บุคลากรการแพทย์
#         • ไม่มี
#     3. โรคประจำตัว (Chronic Disease)
#         • มี
#         • ไม่มี

# กฎการอนุมัติวัคซีน
#  • ถ้าเป็นบุคลากรการแพทย์ –> “ได้รับสิทธิ์วัคซีนทันที”
#  • ถ้าอายุมากกว่า 60 และเป็นกลุ่มเสี่ยงใด ๆ –> “ได้รับสิทธิ์วัคซีน”
#  • ถ้าอายุมากกว่า 40 และมีโรคประจำตัว –> “ได้รับสิทธิ์วัคซีน”
#  • ถ้าอายุมากกว่า 18 และไม่มีความเสี่ยง –> “รอเรียกตามคิว”
#  • นอกเหนือจากนี้ –> “ยังไม่เข้าเกณฑ์”