#จงเขียนโปรแกรมสำหรับการรับสมัครนักศึกษาเข้าคณะเทคโนโลยีสารสนเทศ โดยใช้เงื่อนไขดังนี้
    # 1. ผู้สมัครต้องมีอายุระหว่าง 17 ถึง 25 ปี เท่านั้น
    # 2. หากอายุผ่านเกณฑ์ จะต้องตวรสอบ GPA 
        # 2.1) ถ้า GPA มากกว่าหรือเท่ากับ 3.50 รับเข้าเรียนแบบ "รับตรงพิเศษ"
        # 2.2) ถ้า GPA มากกว่าหรือเท่ากับ 3.00 แต่น้อยกว่า 3.50 รับเข้าเรียนแบบ "รอบปกติ"
        # 2.3) ถ้า GPA น้อยกว่า 3.00 รับเข้าเรียนแบบ 
        #      "ขอเเสดงความเสียใจด้วย ท่านไม่ผ่านเกณฑ์รับเข้าศึกษา"

AGE = int(input("How old are you :"))
GPA = float(input("What your GPA :"))

if 17 <= AGE <= 25 :

    if  GPA >= 3.5 :
        print("รับตรงพิเศษ")
    
    elif 3.0 <= GPA < 3.5 :
        print("รอบปกติ")
    
    else:
        print("ขอเเสดงความเสียใจด้วย ท่านไม่ผ่านเกณฑ์รับเข้าศึกษา")

else:
    print("คุณไม่เข้าเงื่อนไขเกณการรับเข้าศึกษาต่อ...")