#จงเขียนโปรแกรมระบบคัดเลือกพนักงานเข้าทำงานในบริษัท ABC โดยใช้เงื่อนไขดังนี้
    # 1. เพศ (Gender) - เฉพาะรับเฉพาะ ชาย (M) และ หญิง (F) เท่านั้น
    # 2. อายุ (Age) - ต้องอยู่ระหว่าง 22 ถึง 35 ปี
    # 3. วุฒิการศึกษา (Degree) - ต้องเป็นอย่างน้อยปริญญาตรี (Bachelor)
    # 4. ประสบการณ์ทำงาน (Experience)
    #     • ถ้ามีประสบการณ์ มากกว่าหรือเท่ากับ 3 ปี จะได้รับการพิจารณาพิเศษ
    #     • ถ้ามีประสบการณ์ น้อยกว่า 3 ปี จะต้องมีคะแนนสอบสัมภาษณ์ 
    #       (Interview Score) มากกว่าหรือเท่ากับ 80 ถึงจะผ่าน

    # 5. แสดงผลดังนี้:
    #     • “ผ่านการคัดเลือกแบบพิเศษ”
    #     • “ผ่านการคัดเลือก”
    #     • “ไม่ผ่านการคัดเลือก”