# จงเขียนโปรแกรมระบบประเมินผลพนักงานประจำปี
# บริษัทต้องการประเมินผลพนักงานในแต่ละปี โดยใช้เกณฑ์ดังนี้

#     เงื่อนไข:
#     1. ตำแหน่ง (Position)
#         • Manager
#         • Staff
#         • Intern
#     2. คะแนนประเมินผลงาน (Performance Score) เต็ม 100
#     3. จำนวนวันขาดงาน (Absent Days)

#     กฎการประเมิน
#     • Manager:
#         • ถ้า Performance >= 85 และ Absent <= 3 –> “เลื่อนขั้น”
#         • ถ้า Performance >= 70 แต่ Absent <= 5 –> “รักษาระดับ”
#         • นอกเหนือจากนั้น –> “ต้องปรับปรุง”
#     • Staff:
#         • ถ้า Performance >= 80 และ Absent <= 5 –> “เลื่อนขั้น”
#         • ถ้า Performance >= 60 แต่ Absent <= 7 –> “รักษาระดับ”
#         • นอกเหนือจากนั้น –> “ต้องปรับปรุง”
#     • Intern:
#         • ถ้า Performance >= 90 และ Absent == 0 –> “รับเข้าเป็นพนักงาน”
#         • นอกเหนือจากนั้น –> “ไม่ผ่านทดลองงาน”