# การทำงานของคำสั่งเงื่อนไข nested-if เป็นการนำคำสั่ง if มาซ้อนกันหลายๆชั้น เพื่อตรวจสอบเงื่อนไขแบบซ้อนเงื่อนไข 
# เหมาะกับการตรวจสอบเงื่อนไชที่ซับซ้อนมากขึ้นกว่า if-elif-else
# หลักการทำงานของคำสั่งนี้คือ การตรวจสอบเงื่อนไขตามลำดับชั้นไปเรื่อยๆ หากเงื่อนไขใดเป็นจริง 
# ก็จะทำงานภายใต้บล็อกของเงื่อนไขนั้น แต่ถ้าไม่มีเงื่อนไขใดเป็นจริงเลย ก็จะทำงานภายใต้บล็อกของคำสั่ง else

# Ex-1 โปรแกรมคำนวณราคาตั๋วเข้าพิพิธภัณฑ์โดยใช้คำสั่ง nested-if
#  พิพิธภัณฑ์แห่งหนึ่งกำหนดราคาตั๋วเข้าชมสำหรับผู้ใหญ่ 100 บาท สำหรับเด็ก 50 บาท 
#  โดยมีส่วนลดพิเศษสำหรับเดือนนี้ ดังนี้
# 1. กรณีที่ลูกค้าเป็นสมาชิกของพิพิธภัณฑ์ และได้ซื้อตั๋วเด็กร่วมด้วย
#     - ถ้าซื้อตั๋วรวมทั้งหมดตั้งแต่ 10 ใบขึ้นไป จะได้ส่วนลด 50% ทุกที่นั่ง
#     - ถ้าซื้อตั๋วรวมทั้งหมดตั้งแต่ 5 ใบขึ้นไป จะได้ส่วนลด 30% ทุกที่นั่ง
#     - ถ้าซื้อตั๋วรวมทั้งหมดไม่ถึง 5 ใบ จะได้ส่วนลด 20% ทุกที่นั่ง
# 2. กรณีที่ลููกค้าเป็นสมาชิกของพิพิธภัณฑ์ และไม่ซื้อตั๋วเด็ก จะได้ส่วนลด 10% ทุกที่นั่ง
# 3. กรณีที่ลูกค้าไม่ได้เป็นสมาชิก จะได้ส่วนลด 5% ทุกที่นั่ง

print("ราคาตั๋วเข้าชมพิพิธภัณฑ์ ผู้ใหญ่ 100฿ ราคาเด็ก 50฿")
ticket_adult = input("ตั๋วผู้ใหญ่กี่ใบ? :")
ticket_child = input("ตั๋วเด็กกี่ใบ? :")

member = input ("มีบัตรสมาชิกหรือไม่, ถ้ามีพิมพ์ (y) ถ้าไม่มีพิมพ์ (n) :")

#คำนวณราคาตั๋วผู้ใหญ่เเละเด็ก
adult_price = int(ticket_adult)*100
child_price = int(ticket_child)*50

#กรณีเป็นสมาชิก และซื้อบัตรเด็ก
if member == "y" and int(ticket_child) !=0:
    #ถ้าซื้อตั๋วรวมทั้งหมดตั้งแต่ 10 ใบขึ้นไป จะได้ส่วนลด 50% ทุกที่นั่ง
    if int(ticket_adult) + int(ticket_child) >= 10:
        print("เนื่องจากคุณซื้อตั๋วตั้งแต่ 10 ใบ ขึ้นไป ลด 50% ทุกที่นั่ง!!!!")
        total_price = (adult_price + child_price) * 0.5
        

    elif int(ticket_adult) + int(ticket_child) >= 5:
        print("เนื่องจากคุณซื้อตั๋วตั้งแต่ 5 ใบ ขึ้นไป ลด 30% ทุกที่นั่ง!!!!")
        total_price = (adult_price + child_price) * 0.7 #คูณราคาที่ต้องจ่าย
       

    else :
        print("เนื่องจากคุณซื้อตั๋วไม่ถึง 5 ใบ ขึ้นไป ลด 20% ทุกที่นั่ง!!!!")
        total_price = (adult_price + child_price) * 0.8 #คูณราคาที่ต้องจ่าย
    
    print("ราคา: ",total_price, "บาท") 

elif member == "y" and int(ticket_child) ==0:
    print("เนื่องจากลููกค้าเป็นสมาชิกของพิพิธภัณฑ์ และไม่ซื้อตั๋วเด็ก จะได้ส่วนลด 10% ทุกที่นั่ง")
    total_price = (adult_price + child_price) * 0.9
    print("ราคา: ",total_price, "บาท") 

elif member == "n":
    print("ลูกค้าไม่ได้เป็นสมาชิก จะได้ส่วนลด 5% ทุกที่นั่ง")
    total_price = (adult_price + child_price) * 0.95
    print("ราคา: ",total_price, "บาท") 

else :
    print("ERROR")
