# การทำงานของคำสั่งเงื่อนไข nested-if เป็นการนำคำสั่ง if มาซ้อนกันหลายๆชั้น เพื่อตรวจสอบเงื่อนไขแบบซ้อนเงื่อนไข 
# เหมาะกับการตรวจสอบเงื่อนไชที่ซับซ้อนมากขึ้นกว่า if-elif-else
# หลักการทำงานของคำสั่งนี้คือ การตรวจสอบเงื่อนไขตามลำดับชั้นไปเรื่อยๆ หากเงื่อนไขใดเป็นจริง 
# ก็จะทำงานภายใต้บล็อกของเงื่อนไขนั้น แต่ถ้าไม่มีเงื่อนไขใดเป็นจริงเลย ก็จะทำงานภายใต้บล็อกของคำสั่ง else

# Ex-1 โปรแกรมคำนวณราคาตั๋วเข้าพิพิธภัณฑ์โดยใช้คำสั่ง nested-if
#  พิพิธภัณฑ์แห่งหนึ่งกำหนดราคาตั๋วเข้าชมสำหรับผู้ใหญ่ 100 บาท สำหรับเด็ก 50 บาท โดยมีส่วนลดพิเศษสำหรับเดือนนี้ ดังนี้
# 1. กรณีที่ลูกค้าเป็นสมาชิกของพิพิธภัณฑ์ และได้ซื้อตั๋วเด็กร่วมด้วย
#     - ถ้าซื้อตั๋วรวมทั้งหมดตั้งแต่ 10 ใบขึ้นไป จะได้ส่วนลด 50% ทุกที่นั่ง
#     - ถ้าซื้อตั๋วรวมทั้งหมดตั้งแต่ 5 ใบขึ้นไป จะได้ส่วนลด 30% ทุกที่นั่ง
#     - ถ้าซื้อตั๋วรวมทั้งหมดไม่ถึง 5 ใบ จะได้ส่วนลด 20% ทุกที่นั่ง
# 2. กรณีที่ลููกค้าเป็นสมาชิกของพิพิธภัณฑ์ และไม่ซื้อตั๋วเด็ก จะได้ส่วนลด 10% ทุกที่นั่ง
# 3. กรณีที่ลูกค้าไม่ได้เป็นสมาชิก จะได้ส่วนลด 5% ทุกที่นั่ง