#คำสั่งทำซ้ำ While คือการตรวจสอบเงื่อนไขก่อนทำงานเสมอ ถ้าเงื่อนไขเป็นจริงก็จะวนซ้ำทำงานไปเรื่อยๆ 
#จนกระทั่งเงื่อนไขเป็นเท็จจีึงจะหยุดการทำงาน

#Ex.1 -โปรแกรมแสดงเลขคี่ โดยใช้คำสั่งทำซ้ำ While
i = 1
while  i <=10:
    print(i)
    i += 2
print("--------------------------")
    
# Ex.2 -โปรแกรมแสดงค่าตัวเลข 1-5 และหาผลบวกของเลข 1-5  โดยใช้คำสั่งทำซ้ำ While
i = 1
sum = 0
while i <= 5 :
    print(i)
    sum = sum + i 
    i += 1
print(sum)
    

# Ex.3 - โปรแกรมทายตัวเลข
print("เกมส์ทายเลย 1-99")
guess_number = 0

while int(guess_number) != 98:
    guess_number = input("ตัวเลขที่จะทาย ?")
    if (int(guess_number)>98) :
        print("เลขมากเกินไป!!!")
    elif (int(guess_number)<98) :
        print("เลขน้อยเกินไป!!!")
    else :
        print("ทายถูก")

